---
kind: enumMember
id: F:Autodesk.Revit.DB.ViewType.Walkthrough
enum: Autodesk.Revit.DB.ViewType
source: html/bf04dabc-05a3-baf0-3564-f96c0bde3400.htm
---
# Autodesk.Revit.DB.ViewType.Walkthrough

Walk-Through type of 3D view.